library(pacman)
p_load(data.table,tidyverse,readxl,xlsx)


here()

# 一带一路国家名称 ----------------------------------------------------------------
br_vars <- read_excel("../data/一带一路国家名称.xlsx",sheet = "Sheet1") %>% 
  .$country %>% 
  as.vector()




# 一带一路国家参与的电影的所有tt_num ----------------------------------------------------

tt_br <- 
  imdb_belt_road_long %>% 
  group_by(tt_num) %>% 
  summarise(n = n())





# ## “一带一路”沿线国家🐟独作🐟的电影的tt_num -------------------------------------------


tt_br_alone <- 
  tt_br %>% 
  filter(n == 1) %>% 
  .[1] %>% 
  as_vector()


# ## “一带一路”沿线国家🐟合作🐟的电影的tt_num -------------------------------------------



tt_br_col <- 
  tt_br %>% 
  filter(n != 1) %>% 
  .[1] %>% 
  as_vector()
